Repository: wp-plugins/maksukaista
Catalog: maksukaista-*.po
Languages: fi

source: Enable/Disable
fi: Ota käyttöön/Ota pois käytöstä

source: Enable Maksukaista
fi: Ota Maksukaista käyttöön

source: Title
fi: Otsikko

source: This controls the title which the user sees during checkout.
fi: Kirjoita tähän tieto, josta käyttäjä tunnistaa maksutavan.

source: Customer Message
fi: Asiakkaalle näytettävä viesti koskien maksutapaa

source: Sub-merchant id
fi: Alikauppiastunnus

source: Your sub-merchant id found in Maksukaista merchant portal
fi: Kauppiasportaalista löytyvä alikauppiastunnus

source: Private key
fi: Salausavain

source: Private key of the the sub-merchant
fi: Alikauppiaan salausavain

source: Order number prefix
fi: Tilausnumeron etuliite

source: Prefix to avoid order number duplication
fi: Etuliitteellä vältetään samanlaisten tilaustunnusten luonti, jos käytössä on useampi verkkokauppa

source: Payment URL
fi: Maksuosoite

source: URL of the Maksukaista payment page. Only change this if you want to use the test interface.
fi: Maksusivun osoite. Vaihda vain, jos haluat käyttää testirajapintaa.

source: Settle URL
fi: Veloitusosoite

source: URL used to settle previously authorized credit card payments. Only change this if you want to use the test interface.
fi: Veloitusrajapinnan osoite. Vaihda vain, jos haluat käyttää testirajapintaa.

source: Payment methods
fi: Maksutavat

source: Enable bank payments in the Maksukaista payment page.
fi: Ota käyttöön verkkopankkipainikkeet maksusivulla.

source: Enable credit cards in the Maksukaista payment page.
fi: Ota käyttöön luottokorttipainikkeet maksusivulla.

source: Enable credit invoices in the Maksukaista payment page.
fi: Ota käyttöön luottolaskupainikkeet maksusivulla.

source: Enable Maksukaista Lasku in the Maksukaista payment page. (Only for Maksukaista Konversio customers)
fi: Ota käyttöön Maksukaista Lasku maksusivulla. (Vain Maksukaista Konversio -asiakkaille)

source: Send products
fi: Lähetä tuote-erittely Maksukaista-portaaliin

source: Send product breakdown to Maksukaista. (Supported on default Woocommerce installation.)
fi: Lähetä tuote-erittely Maksukaistalle. (Tuettu Woocommercen vakioasennuksessa)

source: Enable embedded payment
fi: Ota käyttöön maksutapojen upotus

source: Enable this if you want to use Embedded-feature when customer chooses his payment method.
fi: Ota maksutapojen upotus käyttöön jos haluat käyttää upotettuja maksutapoja kaupan kassalla.

source: Choose your payment method and click Pay for Order
fi: Valitse maksutapa ja klikkaa Maksa Tilaus -painiketta.

source: Payment card
fi: Korttimaksu

source: Internet banking
fi: Verkkopankkimaksu

source: Invoice or part payment
fi: Lasku tai osamaksu

source: CREATED:
fi: LUOTU:

source: order number
fi: tilaustunnus

source: Order discount
fi: Tilauksen alennukset

source: Payment is authorized. Use settle option to capture funds.
fi: Maksu varmennettu. Maksu veloitetaan painamalla Veloita maksu -painiketta.

source: Payment accepted.
fi: Maksu hyväksystty.

source: Payment was not accepted.
fi: Maksu epäonnistui.

source: Duplicate order number.
fi: Duplikaatti tilausnumero.

source: User disabled. Either your Paybyway account has been temporarily disabled for security reasons, or your sub-merchant is disabled. Visit merchant UI to verify that the sub-merchant is active and that your Paybyway account has not been disabled. If account is disabled, contact support for assistance.
fi: Käyttäjätunnuksenne on lukittu joko turvallisuussyistä, tai alikauppiaanne on poistettu käytöstä. Tarkista Maksukaistan hallintapaneelista ettei alikauppiasta tai kauppiastiliänne ole lukittu. Jos tilinne on lukittu, ota yhteyttä asiakaspalveluumme.

source: Transaction status could not be updated after customer returned from the web page of a bank. Please use the merchant UI to resolve the payment status.
fi: Maksun tilaa ei voitu varmentaa asiakkaan palattua palveluumme verkkopankista. Käytä hallintapaneelia selvittääksesi maksun tilan.

source: Maintenance break. The transaction is not created and the user has been notified and transferred back to the cancel address.
fi: Huoltotauko. Maksua ei luotu, ja asiakaalle on ilmoitettu asiasta.

source: Payment settled.
fi: Maksu veloitettu.

source: Settle payment
fi: Veloita maksu

source: Settlement was successful.
fi: Veloitus onnistui.

source: Settlement failed. Private key and merchant id did not match with order number.
fi: Veloitus pyyntö epäonnistui. Salausavain tai alikauppiastunnus eivät sopineet tilausnumeroon.

source: Settlement failed. Either the payment has already been settled or the payment gateway refused to settle payment for given transaction.
fi: Maksua ei voitu veloittaa. Joko maksu on jo veloitettu, tai luottolaitos hylkäsi veloituspyynnön.

source: Settlement failed. The settlement request did not contain all the needed fields
fi: Odottamaton virhe veloitusta tehdessä.

source: Settlement failed. Unkown error.
fi: Tuntematon paluuarvo. Mikäli ongelma toistuu, ota yhteyttä asiakaspalveluumme.

source: Settlement failed. Failed to parse JSON response.
fi: Vastauksen (JSON) parsinta epäonnistui.
